evidence-package/revalidation/S4-T02/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/canary.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 50s max duration (incl. graceful stop):
              * default: 2 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 2 VUs  01.0s/20s

running (02.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  02.0s/20s

running (03.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  15% ] 2 VUs  03.0s/20s

running (04.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  04.0s/20s

running (05.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  25% ] 2 VUs  05.0s/20s

running (06.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  30% ] 2 VUs  06.0s/20s

running (07.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  35% ] 2 VUs  07.0s/20s

running (08.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  40% ] 2 VUs  08.0s/20s

running (09.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  45% ] 2 VUs  09.0s/20s

running (10.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  10.0s/20s

running (11.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  55% ] 2 VUs  11.0s/20s

running (12.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  60% ] 2 VUs  12.0s/20s

running (13.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  65% ] 2 VUs  13.0s/20s

running (14.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  14.0s/20s

running (15.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  75% ] 2 VUs  15.0s/20s

running (16.0s), 2/2 VUs, 30 complete and 0 interrupted iterations
default   [  80% ] 2 VUs  16.0s/20s

running (17.0s), 2/2 VUs, 32 complete and 0 interrupted iterations
default   [  85% ] 2 VUs  17.0s/20s

running (18.0s), 2/2 VUs, 34 complete and 0 interrupted iterations
default   [  90% ] 2 VUs  18.0s/20s

running (19.0s), 2/2 VUs, 36 complete and 0 interrupted iterations
default   [  95% ] 2 VUs  19.0s/20s

running (20.0s), 2/2 VUs, 38 complete and 0 interrupted iterations
default   [ 100% ] 2 VUs  20.0s/20s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<150' p(95)=24.69ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 80      3.912917/s
    checks_succeeded...: 100.00% 80 out of 80
    checks_failed......: 0.00%   0 out of 80

    ✓ status is 200
    ✓ response is canary

    HTTP
    http_req_duration..............: avg=20.43ms min=16.14ms med=19.16ms max=43.37ms p(90)=22.04ms p(95)=24.69ms
      { expected_response:true }...: avg=20.43ms min=16.14ms med=19.16ms max=43.37ms p(90)=22.04ms p(95)=24.69ms
    http_req_failed................: 0.00%  0 out of 40
    http_reqs......................: 40     1.956459/s

    EXECUTION
    iteration_duration.............: avg=1.02s   min=1.01s   med=1.02s   max=1.04s   p(90)=1.02s   p(95)=1.02s  
    iterations.....................: 40     1.956459/s
    vus............................: 2      min=2       max=2
    vus_max........................: 2      min=2       max=2

    NETWORK
    data_received..................: 20 kB  984 B/s
    data_sent......................: 3.1 kB 153 B/s



running (20.4s), 0/2 VUs, 40 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  20s